app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["text", "Nesse curso você terá uma introdução ao framework Rails!"], ["updated_at", "2022-12-06 23:28:20.721812"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)